[
    {
        "PID":"P001",
        "title":"Merry Meals",
        "description":"Merry Meals is a charitable organization that provides a valuable service to adults who are unable to cook for themselves or maintain their nutritional status due to age, disease, or disability. The program prepares and delivers hot, nutritious meals to qualified recipients living at home. As part of a team project, I contributed to the development of Merry Meals by working on the back-end implementation that connects the program's database to the front-end interface. Specifically, I was responsible for ensuring that the data was properly formatted and securely transmitted between the back-end and front-end components of the program. By working on this project, I gained experience in both front-end and back-end development, as well as contributing to a meaningful cause that helps improve the lives of others.",
        "technology":"Spring Boot, ReactJS, MySQL",
        "images":["ss1.png","ss2.png","ss3.png","ss4.png","ss5.png","ss6.png","ss7.png","ss8.png","ss21.png","ss9.png","ss10.png","ss11.png","ss12.png","ss13.png","ss14.png","ss15.png","ss16.png","ss17.png","ss18.png","ss19.png","ss20.png","ss22.png","ss23.png","ss24.png","ss25.png","ss26.png","ss27.png","ss28.png","ss29.png"]
    },
    {
        "PID":"P002",
        "title":"School Tuition Payment",
        "description":"The School Tuition Payment program is a web-based application that facilitates the payment process for school tuition fees. It serves two types of users, an administrator and a student user. The administrator user manages the user and payment data, while the student user can view their account balances, select payment options, and make secure payments online.<br><br>This program utilizes the PHP programming language to connect the website interface to a secure database, allowing for seamless transactions between students and the school administration. The PHP language is an ideal choice for this type of application as it allows for efficient and secure data handling, while also providing the flexibility to customize the program to meet the unique needs of the school.<br><br>Overall, the School Tuition Payment program streamlines the payment process and provides a user-friendly, convenient, and secure way for students to manage their tuition fees, while also providing a reliable and efficient platform for the school administration to manage user and payment data.",
        "technology":"PHP, MySQL",
        "images":["ss1.png","ss2.png","ss3.png","ss4.png","ss5.png","ss6.png","ss7.png","ss8.png","ss21.png","ss9.png","ss10.png","ss11.png","ss12.png","ss13.png","ss14.png","ss15.png","ss16.png","ss17.png","ss18.png","ss19.png"]
    },
    {
        "PID":"P003",
        "title":"Car Sales Portal",
        "description":"A car sales portal is a website that allows users to buy and sell cars. It provides a platform where people can search for cars based on make, model, registration, and price range. The portal also allows users to register and post cars for sale.<br><br>The technology used to develop this car sales portal includes the Spring Framework, MySQL server, and testing system using risk-based testing (RBT). The Spring Framework is a popular Java-based framework used for building web applications, while MySQL is a relational database management system that allows data to be stored and accessed efficiently.<br><br>The testing system for this car sales portal is based on risk-based testing (RBT). This approach involves identifying the risks associated with the software being developed and then focusing testing efforts on those areas that are most critical.<br><br>The portal has two types of users: administrators and regular users. Administrators can manage user information and all vehicles in the website, while regular users can only manage the cars they post. This allows for a secure and organized system where each user has their own responsibilities and permissions.<br><br>Overall, the car sales portal developed for 'ABC Cars Pte Ltd' provides a user-friendly platform for buying and selling used cars, with robust security measures in place to protect user information and transactions.",
        "technology":"Spring Framework, MySQL ",
        "images":["ss1.png","ss2.png","ss3.png","ss4.png","ss5.png","ss6.png","ss7.png","ss8.png","ss9.png","ss10.png","ss11.png","ss12.png","ss13.png","ss14.png","ss15.png","ss16.png"]
    },
    {
        "PID":"P004",
        "title":"Know Your Neighborhood",
        "description":"The Know-Your-Neighborhood website is an application that aims to provide users with information about their neighborhoods. The original version of the application was built using Spring Boot. However, the goal of this project is to rebuild the application using React.Js and Spring Boot, while also incorporating existing APIs to enable user login and logout.<br><br>Spring Boot is a popular Java-based framework used for building web applications. It allows developers to quickly and easily create standalone, production-grade Spring applications. React.Js, on the other hand, is a popular JavaScript library used for building user interfaces.<br><br>In order to enable user login and logout functionality, the project will utilize existing APIs. The application will have a login button with an API available, which will enable users to securely login and logout of the application. The scope of the project also involves examining and comparing different existing APIs sample by sample, assessing their suitability, identifying potential security issues, and using selected APIs on existing websites to create a login.<br><br>Overall, the rebuilt Know-Your-Neighborhood website will provide users with a modern and user-friendly platform for accessing important information about their neighborhoods. By utilizing the latest technologies such as React.Js and Spring Boot, along with carefully selected APIs, the website will be both functional and secure.",
        "technology":"Spring Boot, MySQl, ReactJS",
        "images":["ss1.png","ss2.png","ss3.png","ss4.png","ss5.png","ss6.png","ss7.png","ss8.png"   ]
    },
    {
        "PID":"P005",
        "title":"ABC Jobs",
        "description":"ABC Jobs Portal is a web-based platform designed to provide job seekers with access to job postings and connect them with potential employers. The portal is built using the Spring Framework, a popular Java-based framework for building web applications.<br><br>The scope of the project involves designing a Community Portal where users can register and apply for jobs. Users can search for other users using various parameters such as First Name, Last Name, Company Name, City & Country. The portal allows users to login, request for forgotten password and update their profile information. The website is also divided into two types of users: Software Programmer and Administrator.<br><br>The ABC Jobs Portal is designed to be user-friendly, allowing job seekers to easily find job listings and apply for positions. The website also provides a range of features, such as the ability to search for other users and view their public profiles. Additionally, users can retrieve their password using email, update their profile after login, and logout when they are done.<br><br>The website also includes an Administration page, which allows administrators to update and delete user data. The platform also includes a feature to send bulk emails to job seekers.<br><br>To ensure the quality of the website, it is tested using JUnit, a popular testing framework for Java applications. This testing ensures that the website functions as intended and is free of errors or bugs.<br><br>Overall, the ABC Jobs Portal provides a user-friendly and efficient platform for job seekers to connect with potential employers. Its use of the Spring Framework and JUnit testing ensures a high-quality user experience.",
        "technology":"Spring Boot, MySQl",
        "images":["ss1.png","ss2.png","ss3.png","ss4.png","ss5.png","ss6.png","ss7.png","ss8.png","ss9.png","ss10.png","ss11.png","ss12.png","ss13.png","ss14.png"]
    },
    {
        "PID":"P006",
        "title":"Jumpstart",
        "description":"Hey everyone! Today, I'm thrilled to share with you the amazing project we've taken on as a team. We've partnered with Jumpstart, a well-known retail chain with 750 stores across the nation. They're facing some significant challenges due to the remote working trend after COVID-19, and they've come to us at Aceadora Tech for help in reshaping their business model towards customer commerce.<br/><br/>Jumpstart is determined to overcome several hurdles, and we've identified key aspects that need our attention to make this project a success. They're looking to explore new business models, increase revenue, reduce costs, enhance the customer experience, boost enterprise agility, improve inventory management, implement predictive analysis, automate processes, drive operational efficiency, adopt an omnichannel approach, and foster conversions and customer loyalty.<br/><br/>To tackle these challenges head-on, we're developing the <b>\"Jumpstart Website\"</b> - a comprehensive technology-driven solution. This website will serve as the digital gateway to Jumpstart's retail ecosystem and will address all the areas we've identified.<br/><br/>Now, let's talk tech! We'll be utilizing <b>Spring Boot</b> as the backend framework for its scalability and ease of development. On the frontend, we're going with <b>ReactJS</b>, a powerful JavaScript library that will enable us to create interactive and responsive user interfaces. To make development faster and more efficient, we'll use <b>Tailwind CSS</b> as our styling framework, thanks to its utility-first approach.<br/><br/>So, what can we expect from the Jumpstart Website? First and foremost, we're implementing a robust e-commerce platform where customers can browse and purchase products from Jumpstart's vast inventory. We want to offer a personalized customer experience, so we'll be using data analytics to provide tailored product recommendations and shopping experiences.<br/><br/>We're also integrating real-time inventory management to ensure customers get accurate information about product availability. By leveraging predictive analytics, we can forecast demand patterns and optimize inventory levels to avoid overstocking or shortages.<br/><br/>But that's not all! We're automating various processes to make everything run smoother, from order processing to inventory updates. This will significantly enhance operational efficiency and reduce human errors.<br/><br/>To stay ahead in the retail game, we're embracing an omnichannel approach. The Jumpstart Website will seamlessly integrate with Jumpstart's physical stores, mobile apps, and other online platforms, offering customers a consistent shopping experience across all touchpoints.<br/><br/>Customer loyalty is crucial, and that's why we're implementing loyalty programs and incentives to encourage repeat purchases and keep customers coming back for more.<br/><br/>In conclusion, the Jumpstart Website is going to be a game-changer for our client, Jumpstart. By using cutting-edge technologies like Spring Boot, ReactJS, and Tailwind CSS, we're building a platform that addresses all their challenges and positions them as a leading player in the customer commerce era.<br/><br/>I'm so proud to be a part of this team, and I know that together, we'll deliver a transformative solution that drives growth and success for Jumpstart in the ever-evolving retail market. Let's get to work and make this project a resounding success!",
        "technology":"Spring Boot, ReactJs",
        "images":["ss1.png","ss2.png","ss3.png","ss4.png","ss5.png","ss6.png","ss7.png","ss8.png","ss9.png","ss10.png","ss11.png","ss12.png","ss13.png","ss14.png","ss15.png","ss16.png","ss17.png"]
    }
    
]
